// 1 Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.
// let countries = {
//     'Ukraine': 'Kyiv',
//     'Poland': 'Warsaw',
//     'Austria': 'Vein',
//     'Indonesia': 'Jakarta',
//     'Canada': 'Ottawa',
// }
// for (let [key, value] of Object.entries(countries)) {
//     console.log(`${value} - це ${key}`);
// }


// 2 Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення

// const numbers = [[1,2,3], [4,5,6], [8,9,10], [2,8,7], [15,78,3]]

// // for(let i = 0; i < numbers.length; i++){
// //     for (let j = 0; j < numbers[i].length; j++){
// //         console.log(numbers[i][j]);
// //     }
// // }
// console.log("MaxValue", Math.max.apply(null, numbers.flat()));


// 3 Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.

// const langs = {
//    uk: ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд'],
//    en: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
// }

// function dayWeek(language, day) {
//     return langs[language][day - 1];
//   }

// console.log(dayWeek('uk', 7));

// 4 Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.
// const numbers = [2,6,3,8]
// numbers.sort(function(a, b) {
//     return a - b;
//   });
//   const sumSum = numbers[0] + numbers[1];
// console.log(sumSum);


// 5 Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.
// let number = [0, 0, 0, 1]
// let numberRow = number.join('');
// let binary = parseInt(numberRow, 2);
// console.log(binary);